[
  {
    "description":"Mark Ellingson, President of the Rochester Athenaeum & Mechanics Institute (RAMI) takes over the Empire State School of Printing located in Ithaca, New York, and it becomes a two-year program.",
    "date":"1/1/1937",
    "pic":"cias.jpg"
  },

  {
    "description":"20 freshman enroll in the program with the first major printing project by the department being the student newspaper, PSIMAR.",
    "date":"1/1/1938",
    "pic":"cias.jpg"
  },

  {
    "description":"Students take over the editorial page of the Democrat and Chronicle for one issue.",
    "date":"1/1/1939",
    "pic":"cias.jpg"
  },

  {
    "description":"Rochester Athenaeum & Mechanics Institute becomes Rochester Institute of Technology.",
    "date":"1/1/1944",
    "pic":"cias.jpg"
  },

  {
    "description":"SPM moves into Clark Building with enrollment dramatically increasing to 136 due to the end of WWII.",
    "date":"1/1/1946",
    "pic":"cias.jpg"
  },

  {
    "description":"First 4-color illustration appears in Student Publication, Rochester Institute of Technology (SPRIT)",
    "date":"1/1/1947",
    "pic":"cias.jpg"
  },

  {
    "description":"RIT and the Lithographic Technical Foundation sponsor a Web Offset Conference and propose a new web press purchase for the school. Gannett Company donates a Teletypesetter system to the School of Printing.",
    "date":"1/1/1948",
    "pic":"cias.jpg"
  },

  {
    "description":"SPRIT changes its name to RIT Reporter.",
    "date":"1/1/1951",
    "pic":"cias.jpg"
  },

  {
    "description":"One-third of seniors major in offset lithography; two-thirds major in letterpress printing. Frank Gannett is presented the prestigious Founders Award for his service to the Institute.",
    "date":"1/1/1952",
    "pic":"cias.jpg"
  },

  {
    "description":"Ellen Eggleton becomes the first woman to receive an Associate of Applied from the School of Printing.",
    "date":"1/1/1953",
    "pic":"cias.jpg"
  },

  {
    "description":"Printing students Carl Nelson and Arthur Borock convince the Athletic Board to adopt the tiger emblem to represent RIT sports.",
    "date":"1/1/1955",
    "pic":"cias.jpg"
  },

  {
    "description":"A section of the Hand Composition Laboratory is dedicated in memoriam to prominent typography, Frederic W. Goudy.",
    "date":"1/1/1961",
    "pic":"cias.jpg"
  },

  {
    "description":"Flexography and gravure printing become part of the curriculum.",
    "date":"1/1/1965",
    "pic":"cias.jpg"
  },

  {
    "description":"New Goss C-38 publication press is installed on the campus.",
    "date":"1/1/1967",
    "pic":"cias.jpg"
  },

  {
    "description":"Melbert B. Cary Jr., Graphic Arts Collection is donated, housing historical and current examples of “fine” printing.",
    "date":"1/1/1969",
    "pic":"cias.jpg"
  },

  {
    "description":"250 freshman enter the program making the total number enrolled an impressive 661 students. MBO folding machine for bindery is donated. Now all major printing processes are represented with up-to-date equipment.",
    "date":"1/1/1977",
    "pic":"cias.jpg"
  },

  {
    "description":"150th Anniversary of RIT",
    "date":"1/1/1978",
    "pic":"cias.jpg"
  },

  {
    "description":"Renovation and rededication of the Cary Graphic Arts Collection is finished.",
    "date":"1/1/1979",
    "pic":"cias.jpg"
  },

  {
    "description":"Labs are updated with $4.2 million in computer equipment.",
    "date":"1/1/1982",
    "pic":"cias.jpg"
  },

  {
    "description":"A SCR-40 Scanning densitometer, a Linotype/Paul scanner, and a Compugraphics typesetter are donated.",
    "date":"1/1/1983",
    "pic":"cias.jpg"
  },

  {
    "description":"Cary Library no longer has a “look but don’t touch” policy and is open for use.",
    "date":"1/1/1984",
    "pic":"cias.jpg"
  },

  {
    "description":"The newspaper production lab that supported the degree program, News Paper Operations Management, begins using a digital page layout system.",
    "date":"1/1/1996",
    "pic":"cias.jpg"
  },

  {
    "description":"New Media courses are first offered as part of SPM curriculum.",
    "date":"1/1/1997",
    "pic":"cias.jpg"
  },

  {
    "description":"The Digital Publishing Center is established, printing student work at RIT.",
    "date":"1/1/1998",
    "pic":"cias.jpg"
  },

  {
    "description":"RIT is selected by the Alfred P. Sloan Foundation to become one of twenty-six Sloan Industry Centers. This center is dedicated to studying major business environment influences in the printing industry.",
    "date":"1/1/2001",
    "pic":"cias.jpg"
  },

  {
    "description":"The Printing Applications Lab at RIT is donated a Sunday 2000 press.",
    "date":"1/1/2005",
    "pic":"cias.jpg"
  },

  {
    "description":"Open Publishing Lab is founded, researching new methods of content creation and developing open source applications for publishing across various media.",
    "date":"1/1/2007",
    "pic":"cias.jpg"
  },

  {
    "description":"75th Anniversary of the School of Print Media.",
    "date":"1/1/2012",
    "pic":"cias.jpg"
  }
]
